import s from "./About.module.scss";
import boxes from "../../assets/Boxes.png";

const About = () => {
  return (
    <>
      {/* верхній блок */}
      <div></div>
      <div>
        <p className={s.title}>
          Наша компаныя Ekip-Auto вже більш ніж 20 років займається імпортом та
          оптовим продажем авто-аксесуарів, авто-комплектуючих та іншого товару
          в Україні.
        </p>
        <div className={s.wrapperText}>
          <p className={s.text}>
            Наша компанія гарантує високу якість продукції та надійність в
            роботі з нашими партнерами. Ми імпортуємо товари безпосередньо з
            Китаю, що дозволяє нам мати конкурентоспроможні цілі на наш товар.
          </p>
          <p className={s.text}>
            Наша компанія базується в місті Одеса і ми пропонуємо постачання
            товара до будь якого міста України, включаючи нещодавно де-окуповані
            території. Ми маємо великий досвід роботи з нашими українськими
            партнерами, та розуміємо наскільки важливо розуміти усі тонкощі
            плідної та перспективної співпраці.
            <img className={s.image} src={boxes} />
          </p>
          <p className={s.text}>
            Ми віримо, що наш досвід та індивідуальний підхід до потреб кожного
            партнера дозволять нам з вами побудувати довгі та вигідні відносини.
          </p>
        </div>
        <img className={s.imageMobile} src={boxes} />
      </div>
    </>
  );
};
export default About;
